Synwit-Co-Ltd/coremark/SWM231/CSL/CMSIS/DeviceSupport/SWM231.h
typedef struct {
	__IO uint32_t CR;
	
	__IO uint32_t SR;
	
	__IO uint32_t IE;						//[0] 运算完成中断使能
	
	     uint32_t RESERVED;
	
	__IO uint32_t DIVIDEND;					//被除数
	
	__IO uint32_t DIVISOR;					//除数
	
	__IO uint32_t QUO;						//商
	
	__IO uint32_t REMAIN;					//余数
} DIV_TypeDef;


#define DIV_CR_DIVGO_Pos			0		//写1启动除法运算，运算完成后自动清零
#define DIV_CR_DIVGO_Msk			(0x01 << DIV_CR_DIVGO_Pos)
#define DIV_CR_DIVSIGN_Pos			1		//0 有符号除法    1 无符号除法
#define DIV_CR_DIVSIGN_Msk			(0x01 << DIV_CR_DIVSIGN_Pos)

#define DIV_SR_DIVEND_Pos			0		//除法运算完成标志，写1清零
#define DIV_SR_DIVEND_Msk			(0x01 << DIV_SR_DIVEND_Pos)
#define DIV_SR_DIVBUSY_Pos			1		//1 除法运算计算中
#define DIV_SR_DIVBUSY_Msk			(0x01 << DIV_SR_DIVBUSY_Pos)




typedef struct {
	__IO uint32_t CR;
	
	__IO uint32_t STA;						// start
	
	__IO uint32_t IE;
	
	__IO uint32_t SR;
	
		 uint32_t RSVD;
	
	__IO uint32_t CLARKIAB;					// CLARK input a and b
	
		 uint32_t RSVD2;
	
	__IO uint32_t CLARKIC;					// CLARK input c
	
	__I  uint32_t CLARKOAB;					// CLARK output αand β
	
		 uint32_t RSVD3;
	
	__IO uint32_t PARKIAB;					// PARK input αand β
	
		 uint32_t RSVD4;
	
	__IO uint32_t PARKRAD;					// PARK sin and cos value of θ
	
		 uint32_t RSVD5;
	
	__I  uint32_t PARKODQ;					// PARK output d and q
	
		 uint32_t RSVD6;
		 
	__IO uint32_t PIDIDQ;					// PID input d and q
	
		 uint32_t RSVD7;
	
	__IO uint32_t PIDREF;					// PID reference value of d and q
	
		 uint32_t RSVD8;
	
	__IO uint32_t PIDMAX;					// PID max value of d and q
	
		 uint32_t RSVD9;
	
	__IO uint32_t PIDMIN;					// PID min value of d and q
	
		 uint32_t RSVD10;
	
	__IO uint32_t PIDKP;					// PID Kp parameter for d and q
	
		 uint32_t RSVD11;
	
	__IO uint32_t PIDKI;					// PID Ki parameter for d and q
	
		 uint32_t RSVD12;
	
	__IO uint32_t PIDLERR;					// PID last error for d and q
	
		 uint32_t RSVD13;
	
	__IO uint32_t PIDLOUT;					// PID last output for d and q
	
		 uint32_t RSVD14;
	
	__I  uint32_t PIDODQ;					// PID output d and q
	
		 uint32_t RSVD15;
	
	__IO uint32_t IPARKIDQ;					// iPARK input d and q
	
		 uint32_t RSVD16;
	
	__IO uint32_t IPARKRAD;					// iPARK sin and cos value of θ
	
		 uint32_t RSVD17;
	
	__I  uint32_t IPARKOAB;					// iPARK output αand β
	
		 uint32_t RSVD18[2];
	
	__IO uint32_t PWMIAB;					// SVPWM input αand β
	
		 uint32_t RSVD19;
	
	__IO uint32_t PWMMIN;					// SVPWM min sample time
	
	__IO uint32_t PWMDLY;					// SVPWM sample delay
	
		 uint32_t RSVD20;
	
	__IO uint32_t PWMTIM;					// SVPWM period and deadzone time
	
		 uint32_t RSVD21;
	
	__I  uint32_t PWMTSP;					// SVPWM sample point time
	
	__I  uint32_t PWMTAD;					// SVPWM A-phase duty time
	
	__I  uint32_t PWMTBD;					// SVPWM B-phase duty time
	
	__I  uint32_t PWMTCD;					// SVPWM C-phase duty time
} FOC_TypeDef;


#define FOC_CR_MODE_Pos				0		// 0 分模块单独控制模式, 1 FOC整模块控制模式
#define FOC_CR_MODE_Msk				(0x01 << FOC_CR_MODE_Pos)
#define FOC_CR_RESET_Pos			1
#define FOC_CR_RESET_Msk			(0x01 << FOC_CR_RESET_Pos)
#define FOC_CR_CLARKI3_Pos			4		// CLARK input 3-args mode, 0 根据CLARKIa、CLARKIb计算输出， 1 根据 根据CLARKIa、CLARKIb、CLARKIc计算输出
#define FOC_CR_CLARKI3_Msk			(0x01 << FOC_CR_CLARKI3_Pos)
#define FOC_CR_CLARKMOD_Pos			5		// CLARK work mode, 0 等幅值变换
#define FOC_CR_CLARKMOD_Msk			(0x01 << FOC_CR_CLARKMOD_Pos)
#define FOC_CR_PWMMOD_Pos			12		// SVPWM work mode, 0 七段式模式
#define FOC_CR_PWMMOD_Msk			(0x01 << FOC_CR_PWMMOD_Pos)
#define FOC_CR_PWMI2_Pos			13		// SVPWM current sample mode, 0 单电阻采样, 1 双电阻采样
#define FOC_CR_PWMI2_Msk			(0x01 << FOC_CR_PWMI2_Pos)

#define FOC_STA_FOC_Pos				0		// 写 1 启动一次 FOC 模块计算, 计算完成自动清零
#define FOC_STA_FOC_Msk				(0x01 << FOC_STA_FOC_Pos)
#define FOC_STA_CLARK_Pos			1
#define FOC_STA_CLARK_Msk			(0x01 << FOC_STA_CLARK_Pos)
#define FOC_STA_PARK_Pos			2
#define FOC_STA_PARK_Msk			(0x01 << FOC_STA_PARK_Pos)
#define FOC_STA_PID_Pos				3
#define FOC_STA_PID_Msk				(0x01 << FOC_STA_PID_Pos)
#define FOC_STA_IPARK_Pos			4
#define FOC_STA_IPARK_Msk			(0x01 << FOC_STA_IPARK_Pos)
#define FOC_STA_SVPWM_Pos			5
#define FOC_STA_SVPWM_Msk			(0x01 << FOC_STA_SVPWM_Pos)

#define FOC_IE_FOC_Pos				0		// FOC 模块计算完成中断使能
#define FOC_IE_FOC_Msk				(0x01 << FOC_IE_FOC_Pos)
#define FOC_IE_CLARK_Pos			1
#define FOC_IE_CLARK_Msk			(0x01 << FOC_IE_CLARK_Pos)
#define FOC_IE_PARK_Pos				2
#define FOC_IE_PARK_Msk				(0x01 << FOC_IE_PARK_Pos)
#define FOC_IE_PID_Pos				3
#define FOC_IE_PID_Msk				(0x01 << FOC_IE_PID_Pos)
#define FOC_IE_IPARK_Pos			4
#define FOC_IE_IPARK_Msk			(0x01 << FOC_IE_IPARK_Pos)
#define FOC_IE_SVPWM_Pos			5
#define FOC_IE_SVPWM_Msk			(0x01 << FOC_IE_SVPWM_Pos)

#define FOC_SR_BUSY_Pos				0		// 只适用于 FOC->CR.MODE = 1 时
#define FOC_SR_BUSY_Msk				(0x01 << FOC_SR_BUSY_Pos)
#define FOC_SR_FOC_Pos				1		// FOC 模块计算完成中断标志，写 1 清零
#define FOC_SR_FOC_Msk				(0x01 << FOC_SR_FOC_Pos)
#define FOC_SR_CLARK_Pos			2
#define FOC_SR_CLARK_Msk			(0x01 << FOC_SR_CLARK_Pos)
#define FOC_SR_PARK_Pos				3
#define FOC_SR_PARK_Msk				(0x01 << FOC_SR_PARK_Pos)
#define FOC_SR_PID_Pos				4
#define FOC_SR_PID_Msk				(0x01 << FOC_SR_PID_Pos)
#define FOC_SR_IPARK_Pos			5
#define FOC_SR_IPARK_Msk			(0x01 << FOC_SR_IPARK_Pos)
#define FOC_SR_SVPWM_Pos			6
#define FOC_SR_SVPWM_Msk			(0x01 << FOC_SR_SVPWM_Pos)
#define FOC_SR_CLARKOF_Pos			16		// CLARK 模块计算溢出标志，写 1 清零
#define FOC_SR_CLARKOF_Msk			(0x01 << FOC_SR_CLARKOF_Pos)
#define FOC_SR_PARKOF_Pos			17
#define FOC_SR_PARKOF_Msk			(0x01 << FOC_SR_PARKOF_Pos)
#define FOC_SR_PIDOF_Pos			18
#define FOC_SR_PIDOF_Msk			(0x01 << FOC_SR_PIDOF_Pos)
#define FOC_SR_IPARKOF_Pos			19
#define FOC_SR_IPARKOF_Msk			(0x01 << FOC_SR_IPARKOF_Pos)
#define FOC_SR_SVPWMOF_Pos			20
#define FOC_SR_SVPWMOF_Msk			(0x01 << FOC_SR_SVPWMOF_Pos)

#define FOC_CLARKIAB_IA_Pos			0
#define FOC_CLARKIAB_IA_Msk			(0xFFFF << FOC_CLARKIAB_IA_Pos)
#define FOC_CLARKIAB_IB_Pos			16
#define FOC_CLARKIAB_IB_Msk			(0xFFFFu<< FOC_CLARKIAB_IB_Pos)

