Synwit-Co-Ltd/coremark/SWM231/CSL/CMSIS/DeviceSupport/SWM231.h
#define FOC_CLARKOAB_OA_Pos			0
#define FOC_CLARKOAB_OA_Msk			(0xFFFF << FOC_CLARKOAB_OA_Pos)
#define FOC_CLARKOAB_OB_Pos			16
#define FOC_CLARKOAB_OB_Msk			(0xFFFFu<< FOC_CLARKOAB_OB_Pos)

#define FOC_PARKIAB_IA_Pos			0
#define FOC_PARKIAB_IA_Msk			(0xFFFF << FOC_PARKIAB_IA_Pos)
#define FOC_PARKIAB_IB_Pos			16
#define FOC_PARKIAB_IB_Msk			(0xFFFFu<< FOC_PARKIAB_IB_Pos)

#define FOC_PARKRAD_SIN_Pos			0
#define FOC_PARKRAD_SIN_Msk			(0xFFFF << FOC_PARKRAD_SIN_Pos)
#define FOC_PARKRAD_COS_Pos			16
#define FOC_PARKRAD_COS_Msk			(0xFFFFu<< FOC_PARKRAD_COS_Pos)

#define FOC_PARKODQ_OD_Pos			0
#define FOC_PARKODQ_OD_Msk			(0xFFFF << FOC_PARKODQ_OD_Pos)
#define FOC_PARKODQ_OQ_Pos			16
#define FOC_PARKODQ_OQ_Msk			(0xFFFFu<< FOC_PARKODQ_OQ_Pos)

#define FOC_PIDIDQ_ID_Pos			0
#define FOC_PIDIDQ_ID_Msk			(0xFFFF << FOC_PIDIDQ_ID_Pos)
#define FOC_PIDIDQ_IQ_Pos			16
#define FOC_PIDIDQ_IQ_Msk			(0xFFFFu<< FOC_PIDIDQ_IQ_Pos)

#define FOC_PIDREF_ID_Pos			0
#define FOC_PIDREF_ID_Msk			(0xFFFF << FOC_PIDREF_ID_Pos)
#define FOC_PIDREF_IQ_Pos			16
#define FOC_PIDREF_IQ_Msk			(0xFFFFu<< FOC_PIDREF_IQ_Pos)

#define FOC_PIDMAX_ID_Pos			0
#define FOC_PIDMAX_ID_Msk			(0xFFFF << FOC_PIDMAX_ID_Pos)
#define FOC_PIDMAX_IQ_Pos			16
#define FOC_PIDMAX_IQ_Msk			(0xFFFFu<< FOC_PIDMAX_IQ_Pos)

#define FOC_PIDMIN_ID_Pos			0
#define FOC_PIDMIN_ID_Msk			(0xFFFF << FOC_PIDMIN_ID_Pos)
#define FOC_PIDMIN_IQ_Pos			16
#define FOC_PIDMIN_IQ_Msk			(0xFFFFu<< FOC_PIDMIN_IQ_Pos)

#define FOC_PIDKP_ID_Pos			0
#define FOC_PIDKP_ID_Msk			(0x3FFF << FOC_PIDKP_ID_Pos)
#define FOC_PIDKP_IQ_Pos			16
#define FOC_PIDKP_IQ_Msk			(0x3FFF << FOC_PIDKP_IQ_Pos)

#define FOC_PIDKI_ID_Pos			0
#define FOC_PIDKI_ID_Msk			(0x3FFF << FOC_PIDKI_ID_Pos)
#define FOC_PIDKI_IQ_Pos			16
#define FOC_PIDKI_IQ_Msk			(0x3FFF << FOC_PIDKI_IQ_Pos)

#define FOC_PIDLERR_ID_Pos			0
#define FOC_PIDLERR_ID_Msk			(0xFFFF << FOC_PIDLERR_ID_Pos)
#define FOC_PIDLERR_IQ_Pos			16
#define FOC_PIDLERR_IQ_Msk			(0xFFFFu<< FOC_PIDLERR_IQ_Pos)

#define FOC_PIDLOUT_OD_Pos			0
#define FOC_PIDLOUT_OD_Msk			(0xFFFF << FOC_PIDLOUT_OD_Pos)
#define FOC_PIDLOUT_OQ_Pos			16
#define FOC_PIDLOUT_OQ_Msk			(0xFFFFu<< FOC_PIDLOUT_OQ_Pos)

#define FOC_PIDODQ_OD_Pos			0
#define FOC_PIDODQ_OD_Msk			(0xFFFF << FOC_PIDODQ_OD_Pos)
#define FOC_PIDODQ_OQ_Pos			16
#define FOC_PIDODQ_OQ_Msk			(0xFFFFu<< FOC_PIDODQ_OQ_Pos)

#define FOC_IPARKIDQ_ID_Pos			0
#define FOC_IPARKIDQ_ID_Msk			(0xFFFF << FOC_IPARKIDQ_ID_Pos)
#define FOC_IPARKIDQ_IQ_Pos			16
#define FOC_IPARKIDQ_IQ_Msk			(0xFFFFu<< FOC_IPARKIDQ_IQ_Pos)

#define FOC_IPARKRAD_SIN_Pos		0
#define FOC_IPARKRAD_SIN_Msk		(0xFFFF << FOC_IPARKRAD_SIN_Pos)
#define FOC_IPARKRAD_COS_Pos		16
#define FOC_IPARKRAD_COS_Msk		(0xFFFFu<< FOC_IPARKRAD_COS_Pos)

#define FOC_IPARKOAB_OA_Pos			0
#define FOC_IPARKOAB_OA_Msk			(0xFFFF << FOC_IPARKOAB_OA_Pos)
#define FOC_IPARKOAB_OB_Pos			16
#define FOC_IPARKOAB_OB_Msk			(0xFFFFu<< FOC_IPARKOAB_OB_Pos)

#define FOC_PWMIAB_IA_Pos			0
#define FOC_PWMIAB_IA_Msk			(0xFFFF << FOC_PWMIAB_IA_Pos)
#define FOC_PWMIAB_IB_Pos			16
#define FOC_PWMIAB_IB_Msk			(0xFFFFu<< FOC_PWMIAB_IB_Pos)

#define FOC_PWMMIN_MIN_Pos			0		// 最小采样时间
#define FOC_PWMMIN_MIN_Msk			(0xFFFF << FOC_PWMMIN_MIN_Pos)
#define FOC_PWMMIN_SAMP3_Pos		16		// 双电阻采样延时参数3
#define FOC_PWMMIN_SAMP3_Msk		(0xFFFFu<< FOC_PWMMIN_SAMP3_Pos)

#define FOC_PWMDLY_SAMP1_Pos		0		// 单电阻采样延时参数1
#define FOC_PWMDLY_SAMP1_Msk		(0xFFFF << FOC_PWMDLY_SAMP1_Pos)
#define FOC_PWMDLY_SAMP2_Pos		16		// 单电阻采样延时参数2
#define FOC_PWMDLY_SAMP2_Msk		(0xFFFFu<< FOC_PWMDLY_SAMP2_Pos)

#define FOC_PWMTIM_PERIOD_Pos		0		// period
#define FOC_PWMTIM_PERIOD_Msk		(0xFFFF << FOC_PWMTIM_PERIOD_Pos)
#define FOC_PWMTIM_DZ_Pos			16		// deadzone
#define FOC_PWMTIM_DZ_Msk			(0xFFFFu<< FOC_PWMTIM_DZ_Pos)

#define FOC_PWMTSP_POINT1_Pos		0		// 采样时间点参数1
#define FOC_PWMTSP_POINT1_Msk		(0xFFFF << FOC_PWMTSP_POINT1_Pos)
#define FOC_PWMTSP_POINT2_Pos		16
#define FOC_PWMTSP_POINT2_Msk		(0xFFFFu<< FOC_PWMTSP_POINT2_Pos)

#define FOC_PWMAD_DUTYA_Pos			0
#define FOC_PWMAD_DUTYA_Msk			(0xFFFF << FOC_PWMAD_DUTYA_Pos)
#define FOC_PWMAD_DUTYAN_Pos		16
#define FOC_PWMAD_DUTYAN_Msk		(0xFFFFu<< FOC_PWMAD_DUTYAN_Pos)

#define FOC_PWMBD_DUTYB_Pos			0
#define FOC_PWMBD_DUTYB_Msk			(0xFFFF << FOC_PWMBD_DUTYB_Pos)
#define FOC_PWMBD_DUTYBN_Pos		16
#define FOC_PWMBD_DUTYBN_Msk		(0xFFFFu<< FOC_PWMBD_DUTYBN_Pos)

#define FOC_PWMCD_DUTYC_Pos			0
#define FOC_PWMCD_DUTYC_Msk			(0xFFFF << FOC_PWMCD_DUTYC_Pos)
#define FOC_PWMCD_DUTYCN_Pos		16
#define FOC_PWMCD_DUTYCN_Msk		(0xFFFFu<< FOC_PWMCD_DUTYCN_Pos)




typedef struct {
	__IO uint32_t DATA;
	
	__IO uint32_t ADDR;
	
	__IO uint32_t ERASE;
	
	__IO uint32_t RSVD;
	
	__IO uint32_t CFG0;
	
	__IO uint32_t CFG1;						//连续写入 0x5A5A5A5A、0xA5A5A5A5 解除 readonly；写入其他任意值恢复 readonly
	
	__IO uint32_t CFG2;
	
	__IO uint32_t CFG3;
	
	__IO uint32_t CFG4;
	
	__IO uint32_t STAT;
	
	__IO uint32_t REMAP;
} FMC_TypeDef;


#define FMC_ERASE_ADDR_Pos			0		//512 Byte per Page
#define FMC_ERASE_ADDR_Msk			(0x1FFFF<< FMC_ERASE_ADDR_Pos)
#define FMC_ERASE_REQ_Pos			24
#define FMC_ERASE_REQ_Msk			(0xFFu<< FMC_ERASE_REQ_Pos)

#define FMC_CFG0_WREN_Pos			0
#define FMC_CFG0_WREN_Msk			(0x01 << FMC_CFG0_WREN_Pos)

#define FMC_STAT_ERASEBUSY_Pos		0
#define FMC_STAT_ERASEBUSY_Msk		(0x01 << FMC_STAT_ERASEBUSY_Pos)
#define FMC_STAT_PROGBUSY_Pos		1
#define FMC_STAT_PROGBUSY_Msk		(0x01 << FMC_STAT_PROGBUSY_Pos)
#define FMC_STAT_READBUSY_Pos		2
#define FMC_STAT_READBUSY_Msk		(0x01 << FMC_STAT_READBUSY_Pos)
#define FMC_STAT_FIFOEMPTY_Pos		3		//Write FIFO Empty
#define FMC_STAT_FIFOEMPTY_Msk		(0x01 << FMC_STAT_FIFOEMPTY_Pos)
#define FMC_STAT_FIFOFULL_Pos		4		//Write FIFO Full
#define FMC_STAT_FIFOFULL_Msk		(0x01 << FMC_STAT_FIFOFULL_Pos)
#define FMC_STAT_READONLY_Pos		7
#define FMC_STAT_READONLY_Msk		(0x01 << FMC_STAT_READONLY_Pos)
#define FMC_STAT_INITDONE_Pos		30
#define FMC_STAT_INITDONE_Msk		(0x01 << FMC_STAT_INITDONE_Pos)
#define FMC_STAT_IDLE_Pos			31
#define FMC_STAT_IDLE_Msk			(0x01u<< FMC_STAT_IDLE_Pos)

#define FMC_REMAP_ON_Pos			0
#define FMC_REMAP_ON_Msk			(0x01 << FMC_REMAP_ON_Pos)
#define FMC_REMAP_OFFSET_Pos		1		//对0x000-0x800这2K地址的访问映射到2K*OFFSET-2K*(OFFSET+1)地址处
#define FMC_REMAP_OFFSET_Msk		(0x0F << FMC_REMAP_OFFSET_Pos)




